#include <inttypes.h>
#include <avr/io.h>
#include <avr/interrupt.h>
#include <avr/sleep.h>
#include <util/delay.h>

int init_UART(void)
{
    //  РЈСЃС‚Р°РЅРѕРІРєР° СЃРєРѕСЂРѕСЃС‚Рё 9600
    UBRRH=0;    //  UBRR=f/(16*band)-1 f=8000000Р“С† band=9600, 
    UBRRL=51;   //  РЅРѕСЂРјР°Р»СЊРЅС‹Р№ Р°СЃРёРЅС…СЂРѕРЅРЅС‹Р№ РґРІСѓРЅР°РїСЂР°РІР»РµРЅРЅС‹Р№ СЂРµР¶РёРј СЂР°Р±РѕС‚С‹
    
//          RXC         -   Р·Р°РІРµСЂС€РµРЅРёРµ РїСЂРёС‘РјР°
//          |TXC        -   Р·Р°РІРµСЂС€РµРЅРёРµ РїРµСЂРµРґР°С‡Рё
//          ||UDRE      -   РѕС‚СЃСѓС‚СЃС‚РІРёРµ РґР°РЅРЅС‹С… РґР»СЏ РѕС‚РїСЂР°РІРєРё
//          |||FE       -   РѕС€РёР±РєР° РєР°РґСЂР°
//          ||||DOR     -   РѕС€РёР±РєР° РїРµСЂРµРїРѕР»РЅРµРЅРёРµ Р±СѓС„РµСЂР°
//          |||||PE     -   РѕС€РёР±РєР° С‡С‘С‚РЅРѕСЃС‚Рё
//          ||||||U2X   -   Р”РІРѕР№РЅР°СЏ СЃРєРѕСЂРѕСЃС‚СЊ
//          |||||||MPCM -   РњРЅРѕРіРѕРїСЂРѕС†РµСЃСЃРѕСЂРЅС‹Р№ СЂРµР¶РёРј
//          76543210
    UCSRA=0b00000000;

//          RXCIE       -   РїСЂРµСЂС‹РІР°РЅРёРµ РїСЂРё РїСЂРёС‘РјРµ РґР°РЅРЅС‹С…
//          |TXCIE      -   РїСЂРµСЂС‹РІР°РЅРёРµ РїСЂРё Р·Р°РІРµСЂС€РµРЅРёРµ РїРµСЂРµРґР°С‡Рё
//          ||UDRIE     -   РїСЂРµСЂС‹РІР°РЅРёРµ РѕС‚СЃСѓС‚СЃС‚РІРёРµ РґР°РЅРЅС‹С… РґР»СЏ РѕС‚РїСЂР°РІРєРё
//          |||RXEN     -   СЂР°Р·СЂРµС€РµРЅРёРµ РїСЂРёС‘РјР°
//          ||||TXEN    -   СЂР°Р·СЂРµС€РµРЅРёРµ РїРµСЂРµРґР°С‡Рё
//          |||||UCSZ2  -   UCSZ0:2 СЂР°Р·РјРµСЂ РєР°РґСЂР° РґР°РЅРЅС‹С…
//          ||||||RXB8  -   9 Р±РёС‚ РїСЂРёРЅСЏС‚С‹С… РґР°РЅРЅС‹С…
//          |||||||TXB8 -   9 Р±РёС‚ РїРµСЂРµРґР°РЅРЅС‹С… РґР°РЅРЅС‹С…
//          76543210
    UCSRB=0b10011000;   //  СЂР°Р·СЂРµС€РµРЅ РїСЂРёС‘Рј Рё РїРµСЂРµРґР°С‡Р° РїРѕ UART

//          URSEL       -   РІСЃРµРіРґР° 1
//          |UMSEL      -   СЂРµР¶РёРј:1-СЃРёРЅС…СЂРѕРЅРЅС‹Р№ 0-Р°СЃРёРЅС…СЂРѕРЅРЅС‹Р№
//          ||UPM1      -   UPM0:1 С‡С‘С‚РЅРѕСЃС‚СЊ
//          |||UPM0     -   UPM0:1 С‡С‘С‚РЅРѕСЃС‚СЊ
//          ||||USBS    -   С‚РѕРї Р±РёС‚С‹: 0-1, 1-2
//          |||||UCSZ1  -   UCSZ1:2 СЂР°Р·РјРµСЂ РєР°РґСЂР° РґР°РЅРЅС‹С…
//          ||||||UCSZ0 -   UCSZ0:2 СЂР°Р·РјРµСЂ РєР°РґСЂР° РґР°РЅРЅС‹С…
//          |||||||UCPOL-   РІ СЃРёРЅС…СЂРѕРЅРЅРѕРј СЂРµР¶РёРјРµ - С‚Р°РєС‚РёСЂРѕРІР°РЅРёРµ
//          76543210
    UCSRC=0b10000110;   //  8-Р±РёС‚РѕРІР°СЏ РїРѕСЃС‹Р»РєР°
}

void send_Uart(int c)//   Отправка байта
{
    PORTD |= (1<<PD2);
    UDR = c;
    while(!(UCSRA&(1<<UDRE))) {};
    while(!(UCSRA&(1<<TXC))) {};
    PORTD &= ~(1<<PD2);
}

volatile char pressed;
volatile char emptyQueue;

int digits[] = { 0b00111111,
                 0b00000110,
                 0b01011011,
                 0b01001111,
                 0b01100110,
                 0b01101101,
                 0b01111101,
                 0b00000111,
                 0b01111111,
                 0b01101111  };

ISR(USART_RXC_vect)
{
    int i, j, data = UDR;
    _delay_ms(1);
    if (!(data&0b10000000))
    {
        /*if (data != 0b01111111)
            emptyQueue = 0;
        else
            emptyQueue = 1;*/
        if (data == 0b01111111 && pressed > 0)
        {
            send_Uart(0);
            pressed--;
        }
        else if (pressed > 0)
        {
            send_Uart(1);
            pressed--;
            for (j = 0; j < 3; j++)
            {
                for (i = 0; i < 50; i++)
                {
                    PORTB = 0b00000110;
                    PORTA = digits[data / 10];
                    _delay_ms(10);
                    PORTB = 0b00000101;
                    PORTA = digits[data % 10];
                    _delay_ms(10);
                } 
            PORTB = 0b00000111;
            _delay_ms(500);
            }
        }
        else 
        {
            send_Uart(0);
        }
    }
}


int main()
{
    pressed = 0;
    emptyQueue = 1;

    sei();

    DDRA  = 0b01111111;
    DDRB  = 0b00000011;
    PORTB = 0b00000111;
    DDRD  = 0b00000110;
    PORTD = 0b00000001;

    init_UART();

    while(1)
    {
        if (!(PINB&0b00000100))
        {
            while (!(PINB&0b00000100));
            pressed++;
        }
        /*if (emptyQueue == 1)
        {
            PORTB = 0b00000110;
            PORTA = digits[0];
            _delay_ms(10);
            PORTB = 0b00000101;
            PORTA = digits[0];
            _delay_ms(10);
        }*/
    }
}